window.addEventListener('DOMContentLoaded', function() {

//Массив стран
let countries = ["Австралия", "Австрия", "Азербайджан", "Албания", "Алжир", "Ангола", 
"Андорра", "Антигуа и Барбуда", "Антильские острова", "Аргентина", "Армения", "Афганистан", 
"Багамские острова", "Бангладеш", "Барбадос", "Бахрейн", "Белиз", "Белоруссия", "Бельгия", 
"Бенин", "Болгария", "Боливия", "Босния и Герцеговина", "Ботсвана", "Бразилия", "Буркина-Фасо", 
"Бурунди", "Бутан", "Вануату", "Ватикан", "Великобритания", "Венгрия", "Венесуэла", "Вьетнам", 
"Габон", "Гаити", "Гайана", "Гамбия", "Гана", "Гватемала", "Гвинея", "Гвинея-Бисау", "Германия", 
"Голландия", "Гондурас", "Гонконг", "Гренада", "Гренландия", "Греция", "Грузия", "Гуам", "Дания", 
"Демократическая Республика Конго", "Джибути", "Доминиканская республика", "Египет", "Замбия", 
"Западная Сахара", "Зимбабве", "Израиль", "Индия", "Индонезия", "Иордания", "Ирак", "Иран", 
"Ирландия", "Исландия", "Испания", "Италия", "Йемен", "Кабо-Верде", "Казахстан", "Камбоджа", 
"Камерун", "Канада", "Катар", "Кения", "Кипр", "Киргизия", "Кирибати", "Китай", "КНДР", 
"Колумбия", "Коморские острова", "Коста-Рика", "Кот-д'Ивуар", "Куба", "Кувейт", "Лаос", 
"Латвия", "Лесото", "Либерия", "Ливан", "Ливия", "Литва", "Лихтенштейн", "Люксембург", 
"Маврикий", "Мавритания", "Мадагаскар", "Македония", "Малави", "Малайзия", "Мали", "Мальдивы", 
"Мальта", "Марокко", "Мартиника", "Мексика", "Микронезия", "Мозамбик", "Молдавия", "Монако", 
"Монголия", "Мьянма", "Намибия", "Непал", "Нигер", "Нигерия", "Никарагуа", "Новая Зеландия", 
"Новая Каледония", "Норвегия", "ОАЭ", "Оман", "Пакистан", "Палестина", "Панама", 
"Папуа-Новая Гвинея", "Парагвай", "Перу", "Польша", "Португалия", "Пуэрто-Рико", 
"Республика Конго", "Республика Корея", "Россия", "Руанда", "Румыния", "Сальвадор", 
"Сан-Марино", "Сан-Томе и Принсипи", "Саудовская Аравия", "Свазиленд", "Сенегал", 
"Сент-Китс и Невис", "Сент-Люсия", "Сербия", "Сингапур", "Сирия", "Словакия", "Словения", 
"Соломоновы острова", "Сомали", "Судан", "Суринам", "США", "Сьерра-Леоне", "Таджикистан", 
"Таиланд", "Тайвань", "Танзания", "Того", "Тонга", "Тринидад и Тобаго", "Тунис", 
"Туркменистан", "Турция", "Уганда", "Узбекистан", "Украина", "Уругвай", "Фиджи", "Филиппины", 
"Финляндия", "Франция", "Французская Гвиана", "Хорватия", "Центральноафриканская Республика", 
"Чад", "Черногория", "Чехия", "Чили", "Швейцария", "Швеция", "Шри-Ланка", "Эквадор", 
"Экваториальная Гвинея", "Эритрея", "Эстония", "Эфиопия", "ЮАР", "Ямайка", "Япония"];

let input = document.getElementById('input'),
    spans = document.getElementById('list').getElementsByTagName('span'),
    list = document.getElementById('list'),
    countryChoice,
    reg,
    selected,
    listItem;

//Привязываем изменение в инпуте по отжатию клавиши через обработчик событий
input.addEventListener('keyup', function() {
  inputChange();//Активируем функцию отслеживания изменений в инпуте
});

//Функция отслеживания изменений в инпуте     
function inputChange(e) {
  e = e || window.event;
//Отслеживание нажатия стрелки вниз          
    if (e.keyCode === 40) {
        selected = -1;
//Перебор выпадающего списка и перемещение по нему вниз стрелкой курсора              
      for (let i = 0; i <= spans.length; i++) 
/* Проверка активного элемента при движении стрелкой курсора вниз на наличие 
класса 'selected' c css-параметром подсветки */
            if (i in spans && spans[i].className === 'selected') {
                spans[i].className = '';
                selected = i;
          }
            selected++;
 /* Каждый активный элемент при перемещении стрелкой курсора вниз получает
класс 'selected' c css-параметром подсветки */      
      for (let i = 0; i <= spans.length; i++) 
            
            if (i in spans && i === selected) {
                spans[i].className = 'selected';
          }
//Отслеживание нажатия стрелки вверх
    } else if (e.keyCode === 38) {
              selected = spans.length;
//Перебор выпадающего списка и перемещение по нему вверх стрелкой курсора                
        for (let i = 0; i <= spans.length; i++) 
/* Проверка активного элемента при движении стрелкой курсора вверх на наличие 
класса 'selected' c css-параметром подсветки */           
              if (i in spans && spans[i].className === 'selected') {
                  spans[i].className = '';
                  selected = i;
              }
              selected--;
/* Каждый активный элемент при перемещении стрелкой курсора вверх получает
класс 'selected' c css-параметром подсветки */              
        for (let i = 0; i <= spans.length; i++)
              
              if (i in spans && i === selected) {
                  spans[i].className = 'selected';
              }
//Отслеживание нажатия Enter
    } else if (e.keyCode === 13) {
//Перебор выпадающего списка и введение в инпут выбранной страны через Enter              
              for (let i = 0; i <= spans.length; i++) 
                  
                  if (i in spans && spans[i].className === 'selected') {
                    input.value = spans[i].textContent;
                    list.textContent = '';
                }           
    } else {
//Очистка выпадающего списка стран
         list.textContent = '';
//Функция проверки выбранной страны на соответствие регулярному выражению        
        if (input.value.length > 0) {
            countries.forEach(function(e, i) {
              //Регулярное выражение
                reg = new RegExp('^' + input.value, 'i');
//Проверка на соответствие регулярному выражению
              if (e.match(reg)) {
                //Вывод списка стран в тегах span каждый с новой строки
                  countryChoice = countries[i];
                  listItem = `<span>${countryChoice}</span><br>`;
                  list.innerHTML += listItem;
                  //Цикл перебора выпадающего списка
                  for (let j = 0; j < spans.length; j++) {
                  /* Функция с обработчиком события, вставляющая выбранную по клику 
                      или через Enter страну в инпут */
                       spans[j].onclick = function() {
                          input.value = spans[j].textContent;
                          list.textContent = '';//Очистка выпадающего списка стран
                       }
                  }     
              }
            });
        }
    }
//Перебор выпадающего списка стран для смены курсора на указательный палец
   for (let i = 0; i < spans.length; i++) {
      spans[i].style.cursor = 'pointer';
    }
}

});